# IFCParameter Template Find Property Mapping Info(Property Setup Type, String, String) Method

Source: https://www.revitapidocs.com/2026/56cc1833-6c8a-343d-5e9f-8cdf0790b863.htm

---

| IFCParameter Template Find Property Mapping Info(Property Setup Type, String, String) Method |
| --- |

Finds the property mapping info in the property set by name.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public IFCPropertyMappingInfo FindPropertyMappingInfo(
	PropertySetupType propertySetupType,
	string propertySetName,
	string propertyName
)
```

```
Public Function FindPropertyMappingInfo (
	propertySetupType As PropertySetupType,
	propertySetName As String,
	propertyName As String
) As IFCPropertyMappingInfo
```

```
public:
IFCPropertyMappingInfo^ FindPropertyMappingInfo(
	PropertySetupType propertySetupType,
	String^ propertySetName,
	String^ propertyName
)
```

```
member FindPropertyMappingInfo :
        propertySetupType : PropertySetupType *
        propertySetName : string *
        propertyName : string -> IFCPropertyMappingInfo
```

#### Parameters

propertySetupType PropertySetupType
:   The property setup type.

propertySetName String
:   The property set name.

propertyName String
:   The property name.

#### Return Value

IFCPropertyMappingInfo
The property mapping info or if not found. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non\-optional argument was null |
| ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

See Also

#### Reference

IFCParameterTemplate Class FindPropertyMappingInfo Overload Autodesk.Revit.DB Namespace